kayrozen/Pajoniiir/firmware/main-deck-jc1060/sdkconfig.defaults
# SDK Configuration defaults for JC1060P470C_I_W_Y draw-bit bring-up example

# Target ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# Production board uses pre-v3 silicon
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# 16MB octal PSRAM in HEX mode (needed for the DPI framebuffer ~1.2 MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SIZE_OVERRIDE=16

# Cache-writeback C2M ops (DSI framebuffer flush) run inside a critical
# section with interrupts disabled - for 400KB..1.2MB that is 0.6..2.5 ms
# with the USB DWC2 ISR masked, which makes the periodic channel miss its
# SOF window (silent iso interval skip = audible glitch). Chunking lets
# interrupts breathe between chunks.
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# v71 tried 20 MHz (EspControl value) - C6 SDIO timeouts 0x107 -> boot loop.
# 40 MHz is the stable value on this board.
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
# v75: C6 2.12.12 firmware boots slower than 2.3.0 - 5 s init timeout made
# esp_hosted abort ("Resetting myself") and boot-loop the board.
CONFIG_ESP_HOSTED_HOST_RESTART_NO_COMMUNICATION_WITH_SLAVE_TIMEOUT=20
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Audio codec support (includes ES8311 device in esp_codec_dev)
CONFIG_CODEC_ES8311_SUPPORT=y

# USB host: allow hubs (DDJ-400 + USB mass storage behind one powered hub)
CONFIG_USB_HOST_HUBS_SUPPORTED=y
# DDJ-400 is a composite audio+MIDI+HID device: its config descriptor
# exceeds the 256-byte default enum buffer. Raise the control transfer
# buffer so it enumerates.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# ESP-Hosted: Wi-Fi/BT via the on-board ESP32-C6 (SDIO slot 1: D0-3=14-17,
# CLK=18, CMD=19 - same pinout as the P4 Function EV board). C6 reset on
# GPIO54, CHIP_PU active-high -> reset line asserted when low.
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_RESET_GPIO=54
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
# C6 boots in parallel with the P4 (released from reset at board init) and is
# ready well before esp_wifi_init - do not re-reset it there, or the 1.5 s
# card-init window closes before the C6 finishes booting.
CONFIG_ESP_HOSTED_SLAVE_RESET_ONLY_IF_NECESSARY=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_FREERTOS_HZ=1000

# OTA: dual-slot with rollback - new image must prove itself (30 s uptime)
# before being marked valid, else bootloader falls back to the other slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# OTA LAN bring-up: allow plain HTTP (production uses signed HTTPS)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Compiler: PERF like the production deck firmware (real-time audio + LVGL
# concurrently; debug optimization leaves too little headroom).
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Log level WARN: ESP_LOGI in the audio/USB path costs latency.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2

# Route the ROM/build console to USB-Serial-JTAG (same connector as flashing)
# so the bring-up log is visible on the host USB port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_BROWNOUT_DET=n
